---
kind: method
id: M:Autodesk.Revit.DB.FormattedText.GetUnderlineStatus
source: html/57d45fc6-f706-e3d6-5425-37e084bf854c.htm
---
# Autodesk.Revit.DB.FormattedText.GetUnderlineStatus Method

Returns whether All , None or a Mixed of characters in the entire text are underlined.

## Syntax (C#)
```csharp
public FormatStatus GetUnderlineStatus()
```

## Returns
The format status of underline on characters FormatStatus .

## Remarks
This function only returns All or None if the entire text contains one character.